Revit 2027 API
BuiltInFailures.AssemblyFailures.AddedElementsNotSamePhaseAsAssembly Property
 Selected Element(s) cannot be added to the assembly. Elements must have the same phases as the assembly to be included in the assembly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AddedElementsNotSamePhaseAsAssembly { get; }
Public Shared ReadOnly Property AddedElementsNotSamePhaseAsAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AddedElementsNotSamePhaseAsAssembly {
	FailureDefinitionId^ get ();
}
static member AddedElementsNotSamePhaseAsAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace